Пансион83/src/AccumulationRegisters/ПродажиКвот/ПродажиКвот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПродажиКвот</name>
  <resources>
    <name>НомераКвота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МестКвота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗабронированоНомеров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗабронированоМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГарантБроньНомеров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГарантБроньМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользованоНомеров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользованоМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОстаетсяНомеров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОстаетсяМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СчетчикДокКвота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаНачКвоты</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжДни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКонКвоты</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаГостей</name>
    <type>
      <types>CatalogRef.ГруппыГостей</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКлиента</name>
    <type>
      <types>CatalogRef.ТипыКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Тариф</name>
    <type>
      <types>CatalogRef.Тарифы</types>
    </type>
  </attributes>
  <attributes>
    <name>RoomRateType</name>
    <type>
      <types>CatalogRef.ТипыТарифов</types>
    </type>
  </attributes>
  <attributes>
    <name>AgentCommission</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AgentCommissionType</name>
    <type>
      <types>EnumRef.AgentCommissionTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Remarks</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>IsRoomQuota</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IsReservation</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IsAccommodation</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>КвотаНомеров</name>
    <type>
      <types>CatalogRef.КвотаНомеров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Гостиница</name>
    <type>
      <types>CatalogRef.Гостиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипНомера</name>
    <type>
      <types>CatalogRef.ТипыНомеров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерРазмещения</name>
    <type>
      <types>CatalogRef.НомернойФонд</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Пансион83/src/InformationRegisters/РесурсыНомеров/РесурсыНомеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РесурсыНомеров</name>
  <dimensions>
    <name>Гостиница</name>
    <type>
      <types>CatalogRef.Гостиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>RoomQuota</name>
    <type>
      <types>CatalogRef.КвотаНомеров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>RoomType</name>
    <type>
      <types>CatalogRef.ТипыНомеров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Date</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Пансион83/src/AccumulationRegisters/ПродажиКвот/RecordSetModule.bsl
//-----------------------------------------------------------------------------
Процедура OnWrite(pCancel, pReplacing)
	If ThisObject.DataExchange.Load Тогда
		Return;
	EndIf;
	// Check if we have to log ГруппаНомеров inventory changes to the change history
	vChangesRcdSet = InformationRegisters.РесурсыНомеров.CreateRecordSet();
	For Each vRQSRow In ThisObject Do
		If (vRQSRow.IsRoomQuota Or vRQSRow.IsReservation Or vRQSRow.IsAccommodation) And 
		   ЗначениеЗаполнено(vRQSRow.Гостиница) And vRQSRow.Гостиница.EnableRoomInventoryChangeHistoryLogging And 
		   vRQSRow.RecordType = AccumulationRecordType.Expense And 
		   ЗначениеЗаполнено(vRQSRow.ДатаНачКвоты) And ЗначениеЗаполнено(vRQSRow.ДатаКонКвоты) And 
		   vRQSRow.ДатаНачКвоты < vRQSRow.ДатаКонКвоты Тогда
		    // Initialize check-in and check-out dates
			vCurDate = BegOfDay(vRQSRow.ДатаНачКвоты);
			vEndDate = BegOfDay(vRQSRow.ДатаКонКвоты);
			// Add records for each date inside period
			While vCurDate <= vEndDate Do
				// Clear recordset and filter from the previous data
				vChangesRcdSet.Clear();
				vChangesRcdSet.Filter.Reset();
				// Set filter to the current data
				vHotelFlt = vChangesRcdSet.Filter.Гостиница;
				vHotelFlt.ComparisonType = ComparisonType.Equal;
				vHotelFlt.Value = vRQSRow.Гостиница;
				vHotelFlt.Use = True;
				vRoomQuotaFlt = vChangesRcdSet.Filter.КвотаНомеров;
				vRoomQuotaFlt.ComparisonType = ComparisonType.Equal;
				vRoomQuotaFlt.Value = vRQSRow.КвотаНомеров;
				vRoomQuotaFlt.Use = True;
				vRoomTypeFlt = vChangesRcdSet.Filter.ТипНомера;
				vRoomTypeFlt.ComparisonType = ComparisonType.Equal;
				vRoomTypeFlt.Value = vRQSRow.ТипНомера;
				vRoomTypeFlt.Use = True;
				vDateFlt = vChangesRcdSet.Filter.ДатаДок;
				vDateFlt.ComparisonType = ComparisonType.Equal;
				vDateFlt.Value = vCurDate;
				vDateFlt.Use = True;
				// Add new record
				vChangesRow = vChangesRcdSet.Add();
				vChangesRow.Гостиница = vRQSRow.Гостиница;
				vChangesRow.КвотаНомеров = vRQSRow.КвотаНомеров;
				vChangesRow.ТипНомера = vRQSRow.ТипНомера;
				vChangesRow.ДатаДок = vCurDate;
				// Write record to the database
				vChangesRcdSet.Write(True);
				// Go to the next date
				vCurDate = vCurDate + 24*3600;
			EndDo;
		EndIf;
	EndDo;
КонецПроцедуры //OnWrite
